/**
  ******************************************************************************
  * @file    TGTHT510_initial.h
  * @author  蒋章
  * @version V1.00
  * @date    20150624
  * @brief   空间站核心舱推进管理器初始化模块头文件
  ******************************************************************************
  */
 
 #ifndef __TGTHT510_initial_h
 #define __TGTHT510_initial_h
 
 
/*宏定义----------------------------------------------------------------------*/
#define TIME_9S_COUNT_NUMBER 0x005a//9s定时器，基时钟100ms
 
 
/*函数声明--------------------------------------------------------------------*/

 void TGTHT510_initial_main(void);

 
 #endif
 
 
 
