/**
  ******************************************************************************
  * @file    TGTHT510_initial.c
  * @author  蒋章
  * @version V1.00
  * @date    20150626
  * @brief   空间站核心舱推进管理器初始化模块C文件
  ******************************************************************************
  */

/*Includes---------------------------------------------------------------------*/
#include "TGTHT510.h"



/******************************************************************************************
**名称：初始化处理主程序
**作者：蒋章
**日期：20150728
**版本：1.00
**描述：
-------------------------------------------------------------------------------------------
**修改时间：
**版本：
**修改内容：
******************************************************************************************/

void TGTHT510_initial_main(void)
{
	TGTHT510_time_initial();
	TGTHT510_CPU_B_receive_data_initial();
	TGTHT510_1553b_initial();
	TGTHT510_collectANDgroup_initial();
	TGTHT510_valvecontrol_initial();
    TGTHT510_tempercontrol_initial();
	TGTHT510_supply_main_initial();
	
	TGTHT510_faultdiagnosis_push_initial();
	TGTHT510_faultdiagnosis_supply_initial();

}


















