/**
  ******************************************************************************
  * @file    supply_main.h
  * @author  蒋章
  * @version V1.00
  * @date    20150624
  * @brief   空间站核心舱推进管理器补加流程主程序头文件
  ******************************************************************************
  */
 
#ifndef __supply_stage_01_input_h
#define __supply_stage_01_input_h
 

/*声明结构体类型--------------------------------------------------------------*/



/*宏定义----------------------------------------------------------------------*/

//步骤--------------------------------------------------------------------------

#define		STEP_01_IS_INPUT		0x0001//是否接受到补加参数



//函数声明----------------------------------------------------------------------

void TGTHT510_supply_stage01_input_main(void);
void TGTHT510_supply_stage01_input_clear(void);
uint16 TGTHT510_supply_stage01_input_decode(void);



#endif
 
 
 
