/**
  ******************************************************************************
  * @file    supply_main.h
  * @author  蒋章
  * @version V1.00
  * @date    20150624
  * @brief   空间站核心舱推进管理器补加流程主程序头文件
  ******************************************************************************
  */
 
#ifndef __supply_stage_23_disconnect_h
#define __supply_stage_23_disconnect_h
 

/*声明结构体类型--------------------------------------------------------------*/



/*宏定义---------------------------------------------------------------------------*/

//步骤step----------------------------------------------------------------------

#define 	STEP_23_SUPPLY_NOP				0x0001//空闲


void TGTHT510_supply_stage21_disconnect_main(void);


#endif
 
 
 
